변수

무언가의 데이터를 저장하는 공간의 이름
- 변수를 선언할 때는 변수 명 = 변수에 들어갈 값
- 데이터 타입 여러가지
- python 외의 대부분 프로그래밍 언어들은 변수를 지정할 때 데이터 타입을 적어준다. 
- python의 경우에는 데이터 타입을 지정하지 않는다.

In [89]:
#데이터의 타입들은 python에서 알아서 지정
a = "test"
b = 1234
print(type(a))
print(type(b))

<class 'str'>
<class 'int'>

In [90]:
a = "test"
print(a)
a= 1234
print(a)
type(a)

test
1234

int

#연산자 
일반적인 사칙연산
- + : 더하기
- - : 빼기
- * : 곱하기
- / : 나누기
- // : 몫
- % : 나머지

In [91]:
x = 10
y = 3
print(x+y, x-y, x*y, x/y, x//y, x%y)

13 7 30 3.3333333333333335 3 1

In [92]:
#대입 연산자
# +=, -=, *=, /=, //=, %=
# a += b -> a = a + b
x += y 
print(x)

13

## 비교연산자
두개의 값을 비교하여 참/거진 의 형태로 출력
- 주로 사용이 되는 곳은 조건문, 반복문에서 사용 된다.

In [93]:
print(x == y) # x와 y가 같다.
print(x != y) # x와 y가 다르다.

False
True

- and : 두 가지의 값이 참이면 참 그 외에는 거짓의 형태로 출력 (&)
- or : 두 가지의 값 중에 하나라도 참이면 참을 출려 (|)
- not = 참은 거짓으로 거짓은 참으로 출력 (~)

In [94]:
# 조건문 (if문)
1. 조건에 맞춰서 컴퓨터에게 지시를 내리기 위한 기본적인 방법
2. 조건식이 참인 경우에 실행 할 코드를 작성
3. 조건식이 거짓인 경우에 실행 할 코드를 작성
4. 실행할 코드들은 파이썬에서는 들여쓰기를 이용

SyntaxError: invalid syntax (2232122945.py, line 2)

In [ ]:
a = 10
if a > 5:
    print("a 는 5보다 크다")
else : 
    print ("a 는 5보다 작다")

a 는 5보다 크다

## 연습문제 
1. input()함수를 이용해서 유저에게서 입력값을 받아오는 변수
2. 유저가 입력한 데이터가 90이상이면 'A' 출력
3. 80이상이면 B 출력, 70이상이면 C, 그 외 F

In [ ]:
a = int(input("점수를 입력하시오 : "))
if a >=90:
    print('A')
elif a>=80 and a<90 :
    print('B')
elif a>=70 and a<80 :
    print('C')
else :
    print('F')

B

### 반복문
1. for문
- for 변수명 in list 형태의 데이터 (range(시작값, 종료값, 증가값))
2. while 문
- 초기값을 지정
- while 조건식
- while 문의 조건식이 참인 경우에 초기값을 증가 시켜서 조건식이 거짓이 될 때까지 반복

In [ ]:
for i in range (1, 10, 1):
    print(i, end = ",")

1,2,3,4,5,6,7,8,9,

In [ ]:
list = ["A", "B", "C", "D"]
for i in list : 
    print(i, end = ',')

A,B,C,D,

In [ ]:
#1부터 10까지의 합
#for 문
sum = 0
for i in range(1, 11,1):
    sum += i
print(sum)

55

In [ ]:
#1부터 10까지의 합
#while 문
i = 1  # 시작값지정
sum = 0
while i <=10:
    sum += i
    i += 1
print(sum)

55

In [ ]:
# while 문을 이용해서 list 형태의 데이터의 값을 하나씩 출력을 하는 방법
list = ["A", "B", "C", "D"]

i = 0
cnt = len(list)

while i <cnt:
    print(list[i])
    i += 1

A
B
C
D

1. continue
- 반복묵으로 돌아간다
- continue에서는 밑에 남아있는 코드를 실행시키지 않고 반복문으로 돌아간다
2. break
- 반복문을 종료한다

In [ ]:
for i in range(1,100,1):
    if i < 10:
        continue
    elif i > 15:
        break
    
    print(i,end=',')

10,11,12,13,14,15,

In [ ]:
# 반복문을 이용해서 1-100까지 반복
#25부터 45까지 합계 출력
sum = 0
for i in range(1,100,1):
    if i <25:
        continue
    elif i>45:
        break
    sum += i
print(sum)

735

In [ ]:
i = 1
sum = 0

while i < 100:
    if i <25:
        i += 1
        continue
    elif i>45:
        break

    sum += i
    i += 1
print(sum)

735

##함수 
1. 변수는 데이터의 값을 가진 데이터의 공간
2. 함수는 데이터의 값이 아니라 입력 받은 데이터를 가지고 무언가를 행동하여 결과값을 돌려주는 코드
3. def 함수명 (매개변수)
4. 함수를 호출할 때는 함수명 (인자)
5. 일반적으로 매개변수의 개수와 인자의 개수가 동일해야 한다.

In [ ]:
## 매개변수가 존재하지 않는 함수
def func_1():
    return "Hello World"
print(func_1())

Hello World

In [ ]:
## 매개변수가 존재하는 함수
def func_2(x,y):
    if type(x) == int and type(y) == int:
        result = x ** y 
    else : 
        result = "입력 받은 값의 타입이 숫자형이 아닙니다."
    return result

print(func_2(5,4))
print(func_2("A","B"))

625
입력 받은 값의 타입이 숫자형이 아닙니다.

In [ ]:
##매개변수에 기본값이 존재하는 경우
def func_3(x,y=4):
    result = x+y
    return result
print(func_3(5))

9

In [ ]:
def func_4(x,y,z):
    result = (x + y) * z
    return result
print(func_4(5,2,3))

21

연습문제
1. 함수를 생성
2. 매개변수 3개 x,y,z 
3. z 타입은 bool
4. z 가 true면 x+y리턴
5. z 가 false 면 x-y리턴
6. z의 타입이 bool 의 형태가 아니면 "z의 타입은 bool 의 형태여야 합니다 " 리탄

In [ ]:
def func_5(x,y,z):

    if type(z) == bool:
        if z == True:
            result = x+y
        else :
            result = x-y
    elif type(z) != bool:
        result =  "z의 타입은 bool의 형태여야 합니다"
    return result
print(func_5(1,4,True))
print(func_5(1,4,False))
print(func_5(1,4,5))

5
-3
z의 타입은 bool의 형태여야 합니다

### Class
1. 변수, 함수의 집합체
2. class 는 보통 이름을 대문자로 시작해서 생성
3. self 라는 매개변수는 --> 자기 자신을 뜻 --> 클래스가 저장되어 있는 공간
4. __init__ 함수 --> 클래스가 생성이 될때 한번만 실행이 되는 함수
5. __init__ 함수는 필요시에만 작성

In [ ]:
class Class_1():
    def __init__(self):
        self.result = 'Class 생성되었습니다.'

    def output(self):
        return self.result
    
class_a = Class_1() # 클래스 생성
class_a.output()

'Class 생성되었습니다.'

In [ ]:
# 변수와 함수가 존재하는 클래스 선언
class Class_2():
    def __init__(self, x, y):
        self.x = x
        self.y = y
    def output(self):
        self.result = self.x + self.y
        return self.result

In [ ]:
class_b = Class_2(5,4)
class_c = Class_2(10,3)

print(class_b.output())
print(class_c.output())

9
13

#연습문제
1. class 선언
2. init 함수에는 self 를 제외한 2개의 매개변수 x,y
3. init 함수를 제외한 2개의 함수를 생성
4. 1 번 함수에서는 x 와 y의 곱을 리턴
5. 2 번 함수에서는 x 와 y의 나눗셈을 리턴

In [ ]:
class Class_3():
    def __init__(self,x,y):
        self.x = x
        self.y = y
    def func_1(self):
        return self.x*self.y
    def func_2(self):
        return self.x/self.y

In [ ]:
class_d = Class_3(6,2)
print(class_d.func_1())
print(class_d.func_2())

12
3.0

# 외부의 라이브러리 사용 방법
1. 라이브러리 설치 (pip install 라이브러리명)
2. 라이브러리 로드 (import 라이브러리)

In [ ]:
pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (1.4.3)
Requirement already satisfied: numpy>=1.18.5; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10" in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (1.23.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/chulwonchae/Library/Python/3.8/lib/python/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (2022.2.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
WARNING: You are using pip version 20.2.3; however, version 22.2.2 is available.
You should consider upgrading via the '/usr/local/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import pandas as pd

#파일의 경로
1. 절대 경로
- 절대 적인 위치
- 누구나 같은 위치로 이동할 수 있는 위치
- 예시 : url, c:/users/....
2. 상대 경로
- 상대적인 위치
- 현재 작업중인 디렉토리에서 상위나 하위 아니면 현재 디렉토리 안에 있는 파일을 지정
- ./ : 현재 작업중인 디렉토리
- ../ ㅖ 상위 디렉토리
- ./폴더명/ : 하위폴더
- 상위로 2번 이동 : ../../
- 하위로 2번 이동 : ./폴더명/폴더명/파일이름
- 상위로 1번 이동 : ../폴더명/

In [ ]:
#csv 파일 로드
#pd.read.csv()

df = pd.read_csv("../csv/uriage.csv")
df

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
1     2019-07-13 13:05     상 품 S         NaN           김우찬
2     2019-05-11 19:42     상 품 a         NaN           김유찬
3     2019-02-12 23:40       상품Z      2600.0           김재현
4      2019-04-22 3:09       상품a         NaN           김강현
...                ...       ...         ...           ...
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2996  2019-03-29 11:14       상품Q         NaN           김지율
2997  2019-07-14 12:56       상품H         NaN           김승주
2998   2019-07-21 0:31       상품D       400.0           정준기

[2999 rows x 4 columns]

In [ ]:
# 대문자로 변환
#upper() 라는 함수는 문자열을 기준으로 대문자로 변경
#데이터 프레임 -> 문자열화 -> 대문자로 변환

#df["item_name"] -> 시리즈 유형 을 문자열화

df["item_name"].str.upper()
#데이터를 확인하는 작업. 데이터의 변화는 x
df["item_name"]= df["item_name"].str.upper()
#

In [ ]:
#공백제거
# 좌측 공백 제거 -> lstrip()
# 우측 공백 제거 -> rstrip()
# 양쪽 공백 제고 -> strip()
# 문자열의 모든 공백 제거 -> replace(" ", "")

#case 1 : 문자열 화 -> 공백 제거
#df["item_name"].str.replace(" ","")


#case 2 : apply()함수를 사용하여 각 항목 별로 로드하여 replace()
#df["item_name"].apply(lambda x : x.replace(" ",""))

#case 3 : apply()함수 안에 일반함수를 사용하는 방법
def change(x):
    result = x.replace(" ","")
    return result

df["item_name"].apply(change)

df["item_name"] = df["item_name"].apply(change)

### 공백제거, 대문자 변경을 해주는 Class생성
1. __init__함수에 파일 경로를 매개변수를 이용하여 값을 받아오는 작업
2. 함수 생성 --> 공백 제거, 대문자로 변환 리턴 --> 이 함수에서 필요한 매개변수 (특정 컬럼)
3. 데이터 프레임을 리턴

In [ ]:
class Class_4():
    def __init__(self, _path):
        self.df = pd.read_csv(_path)

    def change(self, _column):
        #공백제거
        self.df[_column] = self.df[_column].str.replace(" ","")
        #대문자 변환
        self.df[_column] = self.df[_column].str.upper()
        return self.df
    def review(self):
        return self.df

In [ ]:
class_df = Class_4("../csv/uriage.csv")

In [ ]:
class_df.review()

In [ ]:
class_df.change("item_name")

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00       상품S         NaN           김우찬
2    2019-05-11 19:42:00       상품A         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품A         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [108]:
import mod2
import imp  #파이썬 파일 변경시 실행
imp.reload(mod2)

In [109]:
from mod2 import Class_df


class_df_2 = mod2.Class_df("../csv/uriage.csv")

#연습문제
1. mod2 모듈에서 함수 하나 추가
2. 특정 컬럼의 데이터의 타입을 시계열 변경
3. 파생변수 'year', 'month', 'day' 3개 생성 -> 시계열의 데이터의 년, 월, 일 데이터를 삽입

In [110]:
class_df_2.change_datetime("purchase_date")

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00     상 품 S         NaN           김우찬
2    2019-05-11 19:42:00     상 품 a         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품a         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [111]:
class_df_2.review().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   datetime64[ns]
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 93.8+ KB

In [112]:
class_df_2.review()

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00     상 품 S         NaN           김우찬
2    2019-05-11 19:42:00     상 품 a         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품a         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [113]:
class_df_2 = class_df.change_datetime("purchase_date")

In [117]:
class_df_2

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00       상품S         NaN           김우찬
2    2019-05-11 19:42:00       상품A         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품A         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [118]:
class_df_2= class_df.change("item_name")

In [119]:
import mod2
import imp 
imp.reload(mod2)

In [121]:
class_df_2 = mod2.Class_df('../csv/uriage.csv')
class_df_2.change_datetime('purchase_date')
class_df_2.create_date('purchase_date')

           purchase_date item_name  item_price customer_name  year month day
0    2019-06-13 18:02:00       상품A       100.0           김가온  2019    06  13
1    2019-07-13 13:05:00     상 품 S         NaN           김우찬  2019    07  13
2    2019-05-11 19:42:00     상 품 a         NaN           김유찬  2019    05  11
3    2019-02-12 23:40:00       상품Z      2600.0           김재현  2019    02  12
4    2019-04-22 03:09:00       상품a         NaN           김강현  2019    04  22
...                  ...       ...         ...           ...   ...   ...  ..
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민  2019    02  15
2995 2019-06-22 04:03:00       상품M      1300.0           김재원  2019    06  22
2996 2019-03-29 11:14:00       상품Q         NaN           김지율  2019    03  29
2997 2019-07-14 12:56:00       상품H         NaN           김승주  2019    07  14
2998 2019-07-21 00:31:00       상품D       400.0           정준기  2019    07  21

[2999 rows x 7 columns]

In [122]:
class_df_2.change("item_name")

           purchase_date item_name  item_price customer_name  year month day
0    2019-06-13 18:02:00       상품A       100.0           김가온  2019    06  13
1    2019-07-13 13:05:00       상품S         NaN           김우찬  2019    07  13
2    2019-05-11 19:42:00       상품A         NaN           김유찬  2019    05  11
3    2019-02-12 23:40:00       상품Z      2600.0           김재현  2019    02  12
4    2019-04-22 03:09:00       상품A         NaN           김강현  2019    04  22
...                  ...       ...         ...           ...   ...   ...  ..
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민  2019    02  15
2995 2019-06-22 04:03:00       상품M      1300.0           김재원  2019    06  22
2996 2019-03-29 11:14:00       상품Q         NaN           김지율  2019    03  29
2997 2019-07-14 12:56:00       상품H         NaN           김승주  2019    07  14
2998 2019-07-21 00:31:00       상품D       400.0           정준기  2019    07  21

[2999 rows x 7 columns]

In [124]:
class_df_2.review().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   datetime64[ns]
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
 4   year           2999 non-null   object
 5   month          2999 non-null   object
 6   day            2999 non-null   object
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 164.1+ KB

In [126]:
class_df_3 = mod2.Class_df("../csv/Sales Records.csv")

In [131]:
class_df_3.review()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,1/13/2011,141515767,2/1/2011,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,9/11/2012,500364005,10/6/2012,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,10/27/2015,127481591,12/5/2015,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,Asia,Laos,Beverages,Online,H,7/15/2014,199342048,7/31/2014,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Europe,Liechtenstein,Cosmetics,Online,C,10/27/2012,763044106,11/1/2012,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Sub-Saharan Africa,Democratic Republic of the Congo,Vegetables,Offline,M,2/14/2013,848579967,3/20/2013,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,Sub-Saharan Africa,South Africa,Meat,Online,L,2/19/2017,298185956,2/22/2017,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Asia,Mongolia,Snacks,Offline,M,4/12/2016,824410903,4/16/2016,361,152.58,97.44,55081.38,35175.84,19905.54

In [133]:
class_df_3.change_time("Order Date")

AttributeError: 'Class_df' object has no attribute 'change_time'